import json
import random
from datetime import datetime

# --- ДАНІ (Константи) ---
SUBJECTS_LIST = [
    "Філософія", "Історія і культура України", "Українська мова (за професійним спрямуванням)", "Педагогіка",
    "Іноземна мова для професійного спілкування", "Іноземна мова для академічного спілкування (магістри)", "Загальна психологія",
    "Вікова і педагогічна психологія", "Соціальна психологія", "Психологія (загальна)", "Психологія лідерства",
    "Історія педагогіки", "Методика виховної роботи", "Основи педагогічної майстерності", "Правознавство", 
    "Риторика",  "Література і кіно", "Права та свободи людини і громадянина", "Цивільний захист", "Безпека життєдіяльності та основи охорони праці",
    "Базова загальновійськова підготовка", "Тренінг розвитку стресостійкості", "Домедична допомога", "Фізична культура",
    "Польська мова: початковий курс", "Екологія", "Фінансова грамотність", "Числові системи", "Комп'ютерна статистика",
    "Математичний аналіз", "Лінійна алгебра", "Лінійна алгебра і аналітична геометрія", "Аналітична геометрія",
    "Алгебра і теорія чисел", "Елементарна математика", "Елементарна математика з точки зору вищої",
    "Диференціальні рівняння та рівняння математичної фізики", "Рівняння математичної фізики", 
    "Теорія ймовірностей та математична статистика", "Основи статистики і аналізу даних", "Прикладна статистика, педагогічні вимірювання та моніторинг якості освіти", 
    "Ймовірнісно-статистичні методи досліджень", "Математична логіка і теорія алгоритмів", "Дискретна математика",
    "Основи алгебри і дискретної математики", "Теорія алгоритмів", "Функціональний аналіз", "Комплексний аналіз",
    "Диференціальна геометрія і топологія", "Основи геометрії", "Конструктивна геометрія", "Додаткові розділи геометрії",
    "Комбінаторика і основи теорії ймовірностей", "Методи обчислень", "Методи оптимізації та дослідження операцій", 
    "Математичні методи у прийнятті рішень", "Системний аналіз та математичне моделювання", "Математичне моделювання природничих і соціально-економічних процесів", 
    "Математичні основи захисту інформації", "Інтегральні рівняння і варіаційне числення", "Асимптотичні методи математики", 
    "Основи аналізу Фур'є", "Основи теорії солітонів", "Аналіз випадкових процесів і ланцюги Маркова", 
    "Статистичні методи обробки експериментальних даних", "Історія математики", "Експериментальна фізика", 
    "Загальна фізика", "Механіка", "Молекулярна фізика і термодинаміка", "Електрика і магнетизм Оптика",
    "Атомна і ядерна фізика", "Практикум розв'язування задач з фізики", "Теоретична фізика",
    "Класична механіка", "Квантова механіка", "Статистична фізика і термодинаміка", "Електронна теорія речовини", 
    "Фізика та методика її навчання у ліцеях / академічних ліцеях", "Вибрані питання сучасної фізики, техніки, астрономії", 
    "Фізика живих систем", "Фізичні основи роботи біомедичної техніки", "Астрофізика", "Вибрані питання астрономії", 
    "Практикум з фізичного експерименту та астрономічних спостережений", "Сучасне природознавство і методика його навчання",
    "Інформатика (загальна)", "Інформатика та програмування", "Шкільний курс інформатики", "Інформаційні технології опрацювання даних",
    "Інформаційна культура", "Основи штучного інтелекту", "Машинне навчання в освіті", "Програмування", 
    "Сучасні технології програмування, машинне навчання та ШІ в освіті", "Алгоритми і структури даних",
    "Основи структурного та об'єктно-орієнтованого програмування", "Основи веб-програмування",
    "Побудова та аналіз алгоритмів у шкільній інформатиці", "Операційні системи та мережеві технології в шкільному курсі інформатики",
    "Архітектура та програмне забезпечення комп'ютерних систем", "Бази даних та інформаційні системи",
    "Системи керування базами даних", "Комп'ютерно орієнтовані технології навчання / в професійній діяльності", 
    "Цифрові технології обробки графічних зображень, анімації та відео", "Цифрові технології наукових досліджень", 
    "Системи комп'ютерної математики", "Комп'ютерне моделювання систем і процесів", "3D-моделювання", 
    "Основи кібербезпеки", "Технології захисту інформації", "Основи робототехніки та креативне програмування", 
    "Мобільні застосунки / технології у навчанні", "Дистанційний супровід шкільного курсу математики",
    "Спеціальна інформатика", "Программні засоби математичного спрямування", "Основи теорії інтелектуальних систем",
    "Поглиблений курс шкільної інформатики", "Інклюзивний медіапростір: європейський досвід", 
    "Методика навчання інформатики", "Методика навчання математики", "Методика навчання фізики", 
    "Технології навчання фізики та астрономії", "Теорія і методика поглибленого навчання (алгебри, стереометрії)",
    "Наукові основи поглибленого навчання математики", "Теорія і практика математичних / інформатичних олімпіад",
    "Практикум розв'язування олімпіадних задач (алгебра, геометрія)", "Вибрані питання шкільного курсу фізики / математики", 
    "Методологія і методика наукових досліджень", "Педагогіка і психологія вищої школи", "Освітометрія",
    "Моделювання діяльності викладача математики ЗВО", "Моніторинг, діагностика та оцінювання навчання з математики", 
    "Інноваційні технології навчання математики", "Управління навчальними проектами / проєктною діяльністю", "Методика інклюзивного навчання інформатики",
    "Дослідницько-проєктувальна діяльність вчителя математики", "Інноваційний педагогічний досвід навчання математики",
    "Теорія і практика підготовки з фізики до ЗНО", "Практикум STEM-експерименту"
]

GROUPS_DATA = {
    "1СОМ": ["Алексєєнко Анна Олександрівна", "Гайдай Анатолій Олегович", "Журбелюк Павліна Павлівна", "Зарудняк Анастасія Сергіївна", "Книш Денис Олексійович", "Крапля Лілія Анатоліївна", "Логашкін Денис Владиславович", "Мазур Вероніка Сергіївна", "Мельник Богдан Олексійович", "Первий Андрій Миколайович", "Сулима Дарина Віталіївна", "Тимошенко Марія Миколаївна", "Шапельська Катерина Дмитрівна", "Шевчук Марія Олександрівна"],
    "1СОІ": ["Лисенко Тимофій Сергійович", "Лівий Павло Владиславович", "Муренко Степан Андрійович", "Поспелов Назар Андрійович", "Рибчук Андрій Олегович", "Томашевський Артем Васильович"],
    "1М": ["Басараба Олександр Ігорович", "Бондар Владислав Васильович", "Даньковський Нікіта Глібович", "Кокарєва Вікторія Олександрівна", "Сулима Маргаріта Андріївна", "Тишкіна Анастасія Павлівна"],
    "2СОМ": ["Адамлюк Владислав Романович", "Бичко Дар'я Юріївна", "Бугрова Юлія Вікторівна", "Гончарук Ангеліна Сергіївна", "Гріщенко Світлана Василівна", "Гунько Іван Романович", "Дорош Руслан Миколайович", "Калінін Євген Олексійович", "Кисиль Яна Юріївна", "Кравчук Юлія Юріївна", "Мартинюк Діана Сергіївна", "Назарук Діана Володимирівна", "Пасічник Софія Назарівна", "Пустовіт Анастасія Дмитрівна", "Сичук Ангеліна Олександрівна", "Слободянюк Вікторія Вікторівна", "Чорна Єлизавета Миколаївна"],
    "2СОФА": ["Миколайчук Максим Олександрович", "Фурсік Марія Михайлівна"],
    "2СОІ": ["Адамов Владислав Виталійович", "Векшин Ігор Олександрович", "Діденко Артем Сергійович", "Кирилюк Ярослав Сергійович", "Кузовлєва Анастасія Сергіївна", "Новак Лілія Володимирівна", "Остапов Антон Юрійович", "Таранюк Степан Євгенійович", "Шило Гліб Олександрович", "Шпак Дар'я Володимирівна"],
    "2М": ["Блонський Владислав Ярославович", "Бондар Наталія Вікторівна", "Головата Валерія Олександрівна", "Граждан Тімур Костянтинович", "Гуцол Альона Василівна", "Левенець Владислава Дмитрівна", "Левченко Анна Миколаївна", "Миколаєнко Дмитро Олександрович", "Семенюк Ангеліна Дмитрівна", "Яцюк Вікторія Сергіївна"],
    "3СОМ": ["Винарчик Софія Степанівна", "Волинська Анна Сергіївна", "Кланцатий Костянтин Сергійович", "Крамар Анна Сергіївна", "Кузьменко Карина Леонідівна", "Лисаков Віталій Володимирович", "Лучко Анастасія Дмитрівна", "Мартиненко Владислав Ігорович", "Михайленко Вікторія Іванівна", "Нефедова Ксенія Євгеніїна", "Паплінська Ірина Петрівна", "Рудкевич Ольга Миколаївна", "Серветнік Лілія Ярославівна", "Усатюк Олександра Вадимівна", "Хованець Марʼяна Миколаївна", "Чернуха Софія Юріївна", "Шпортко Вікторія Михайлівна"],
    "3СОІ": ["Бабій Олександра Віталіївна", "Діхтяр Віталій Володимирович", "Довжок Віктор Петрович", "Казанок Єгор Михайлович", "Маковіцький Олексій Леонідович", "Письменний Сергій Васильович", "Репей Анна Сергіївна", "Станкевич Олександр Миколайович", "Стратійчук Іванна Олександрівна", "Шатковський Дмитро Петрович", "Шумило Дарина Василівна"],
    "3СОФА": ["Клапущак Богдан Віталійович", "Присяжнюк Іванна Олександрівна", "Стасюк Вадим Вольдемарович", "Теракт Дмитро Васильович", "Хіхло Ірина Валеріївна"],
    "3М": ["Бачок Микола Петрович", "Коберник Ірина Олександрівна", "Попіль Юліана Андріївна", "Семенець Вероніка Дмитрівна", "Цирульнікова Марина Віталіївна"],
    "4СОМ": ["Головата Марина Володимирівна", "Гріщенко Андрій Русланович", "Кліщ Юлія Сергіївна", "Мартинюк Анастасія Ігорівна", "Маховська Вікторія Юріївна", "Моцна Марія Анатоліївна", "Мруг Дарія Валентинівна", "Муляр Карина Сергіївна", "Неврюєва Дар'я Василівна", "Никитюк Юлія Ігорівна", "Павлова Вікторія Сергіївна", "Севастьянова Каріна Олегівна", "Струбчевська Дар'я Вячеславівна", "Тімощенко Ірина Романівна", "Фаштинська Марія Василівна", "Фурман Наталія Вікторівна", "Ходик Аліна Радіонівна", "Швець Наталія Юріївна"],
    "4СОІ": ["Барановський Нікіта Ярославович", "Вишковська Вероніка Олександрівна", "Вогник Владислав Олександрович", "Зозуля Юлія Миколаївна", "Красілич Назарій Євгенович", "Мальований Віталій Вадимович", "Пелешок Анастасія Юріївна", "Савіна Карина Дмитрівна", "Сорока Олександр Миколайович", "Табашнюк Каріна Олександрівна", "Шикір Тарас Романович"],
    "4М": ["Карнаущук Анастасія Олегівна", "Коцюбан Діана Вікторівна", "Коцюбинська Анна Олександрівна", "Саїнчук Анастасія Павлівна", "Шельман Лілія Віталіївна", "Якимчук Аліна Юріївна"],
    "4СОФА": ["Дельнецький Ігор Андрійович", "Довгаль Марина Геннадіївна", "Зозуля Софія Андріївна", "Коваленко Анна Олександрівна", "Чаленко Ольга Володимирівна"],
    "1МСОІ": ["Афанасьєв Дмитро Андрійович", "Брижак Владислав Анатолійович", "Вавшко Віталій Сергійович", "Кізім Степан Вадимович", "Коваленко Марічка Сергіївна", "Корольов Максим Сергійович", "Мулярчук Сергій Павлович", "Никитюк Діана Валентинівна", "Раплєв Андрій Євгенович", "Шевчук Євген Ігорович"],
    "1ММ": ["Гетманчук Анна Валентинівна", "Кухта Іванка Іванівна", "Стесюк Анастасія Ігорівна", "Воробець Анастасія Віталіївна", "Куліш Олександра Романівна", "Логвіненко Ганна Олександрівна", "Онищук Олексій Олександрович", "Юрчук Дарина Олександрівна"],
    "1МСОМ": ["Комарова Каріна Вадимівна", "Злотковська Алла Віленівна", "Таранюк Надія Василівна", "Казмірчук Валентина Вікторівна", "Остапчук Діана Олегівна", "Пашківський Богдан Олексійович", "Михайльо Лідія Олександрівна", "Торкотюк Юрій Сергійович", "Климчук Анна Олександрівна", "Дячук Єгор Сергійович", "Іськов Ігор Валерійович", "Брицова Ілона Богданівна", "Романько Олена Олександрівна", "Біла Карина Русланівна", "Антошко Марина Олександрівна", "Бондаренко Єлена Олександрівна", "Гурман Катерина Ігорівна", "Донська Анастасія Ігорівна", "Поштарук Сніжана Сергіївна", "Байда Каріна Ігорівна", "Мамчур Мирослава Дмитрівна", "Салкевич Дарина Романівна", "Sемчук Олег Васильович"],
    "1МСОФА": ["Міщенко Владислав Сергійович", "Журжа Артем Арсенович", "Бережна Регіна Олександрівна", "Дмитренко Анастасія Олександрівна", "Дріма Віталій", "Олексійко Олександр Олександрович"],
    "2МСОМ": ["Ворожко Вікторія Олексіївна", "Гончар Сергій Віталійович", "Дзюняк Олександр Олексійович", "Зіняк Іванна Іванівна", "Іванова Анастасія Сергіївна", "Кеба Анастасія Олександрівна", "Козярчук Катерина Миколаївна", "Лещенко Тетяна Тимурівна", "Михайлюта Олена Василівна", "Руткевич Тетяна Іванівна", "Рябуха Вероніка Олександрівна", "Сидоренко Анна Олександрівна", "Тищенко Яна Михайлівна", "Шуриняк Олександр Ігорович"],
    "2МСОФА": ["Бусел Софія Юріївна", "Гулич Наталія Русланівна", "Кульпекін Ігор Миколайович", "Миронюк Марина Анатоліївна"],
    "2МСОІ": ["Коптєв Іван Валерійович", "Косенюк Марк Володимирович", "Таскаєв Дмитро Леонідович", "Шевчук Павло Вікторович"],
    "2ММ": ["Гриценко Володимир Борисович", "Дідусенко Анастасія Вікторівна", "Кізім Степан Вадимович", "Піменов Андрій Сергійович", "Чернієнко Артем Вікторович"]
}

TEACHERS_DATA = {
    "Кафедра алгебри і методики навчання математики": [
        "Коношевський Олег Леонідович (Завідувач кафедри алгебри і методики навчання математики)", "Матяш Ольга Іванівна", "Михайленко Любов Федорівна", "Воєвода Аліна Леонідівна (Декан факультету математики, фізики і комп'ютерних наук)",
        "Вотякова Леся Андріївна", "Калашніков Ігор В’ячеславович", "Наконечна Людмила Йосипівна", "Панасенко Олексій Борисович (Заступник декана з навчальної роботи)",
        "Тютюнник Діана Олегівна", "Комарова Карина Вадимівна"
    ],
    "Кафедра математики та інформатики": [
        "Ковтонюк Мар'яна Михайлівна (Завідувач кафедри математики та інформатики)", "Бак Сергій Миколайович (Заступник декана з наукової роботи)", "Клочко Оксана Віталіївна",
        "Граняк Валерій Федорович", "Ковтонюк Галина Миколаївна", "Косовець Олена Павлівна (Заступник декана з виховної та соціальної роботи)", "Крупський Ярослав Володимирович",
        "Соя Олена Миколаївна", "Тютюн Любов Андріївна", "Леонова Іванна Миколаївна", "Поліщук Віталій Олегович", "Ярош Оксана Іванівна"
    ],
    "Кафедра фізики і методики навчання фізики, астрономії": [
        "Сільвейстр Анатолій Миколайович (Завідувач кафедри фізики і методики навчання фізики, астрономії)", "Заболотний Володимир Федорович", "Білюк Анатолій Іванович",
        "Думенко Вікторія Петрівна", "Моклюк Микола Олексійович", "Ксендзова Оксана Сергіївна", "Мамічева Інна Олексіївна",
        "Мороз Ярослав Олексійович", "Сіваєва Наталія Віталіївна", "Журжа Артем Арсенович"
    ]
}

# --- КЛАС СИСТЕМИ ---
class TeacherCabinet:
    def __init__(self, teacher_name):
        self.teacher_info = {"ПІБ": teacher_name, "Статус": "Авторизовано"}
        self.schedule = []
        self.journals = {}
        self.exam_reports = []

    def add_lesson_from_list(self, time, subject_index, group_name):
        """Додає заняття, використовуючи індекси з SUBJECTS_LIST"""
        if subject_index < len(SUBJECTS_LIST) and group_name in GROUPS_DATA:
            subject = SUBJECTS_LIST[subject_index]
            lesson = {
                "Час": time,
                "Дисципліна": subject,
                "Група": group_name,
                "Студенти": GROUPS_DATA[group_name]
            }
            self.schedule.append(lesson)
            print(f"✅ Додано: {subject} для групи {group_name}")
        else:
            print("❌ Помилка: Невірний предмет або назва групи.")

    def create_journal_for_group(self, group_name, subject_index):
        """Автоматично створює журнал на основі реальних даних груп"""
        subject = SUBJECTS_LIST[subject_index]
        if group_name in GROUPS_DATA:
            journal_id = f"{subject}_{group_name}"
            self.journals[journal_id] = {
                "дисципліна": subject,
                "група": group_name,
                "студенти": {name: {"оцінки": [], "присутність": True} for name in GROUPS_DATA[group_name]}
            }
            print(f"📖 Створено журнал: {subject} ({group_name}). Кількість студентів: {len(GROUPS_DATA[group_name])}")
        else:
            print(f"❌ Групу {group_name} не знайдено.")

    def set_auto_grade(self, journal_id, student_name, ects_grade):
        """Проставляє оцінку з автоматичною конвертацією в національну шкалу"""
        mapping = {"A": "Відмінно", "B": "Добре", "C": "Добре", "D": "Задовільно", "E": "Задовільно", "F": "Незадовільно"}
        if journal_id in self.journals and student_name in self.journals[journal_id]["студенти"]:
            national = mapping.get(ects_grade, "н/а")
            entry = {"ECTS": ects_grade, "Нац": national, "Дата": datetime.now().strftime("%d.%m.%Y")}
            self.journals[journal_id]["студенти"][student_name]["оцінки"].append(entry)
            print(f"📝 {student_name}: {ects_grade} ({national})")

# --- ЗАПУСК ДЕМОНСТРАЦІЇ ---

# 1. Обираємо викладача
teacher = TEACHERS_DATA["Кафедра математики та інформатики"][0]
cabinet = TeacherCabinet(teacher)
print(f"--- ВЕБ-КАБІНЕТ ВИКЛАДАЧА: {teacher} ---")

# 2. Формуємо розклад (Предмет 93: Основи штучного інтелекту)
cabinet.add_lesson_from_list("10:00", 93, "1СОІ")

# 3. Створюємо журнал для реальної групи (Предмет 30: Лінійна алгебра)
cabinet.create_journal_for_group("1СОМ", 30)

# 4. Проставляємо оцінки реальним студентам групи 1СОМ
group_list = GROUPS_DATA["1СОМ"]
journal_key = f"{SUBJECTS_LIST[30]}_1СОМ"

print("\n--- ПРОСТАВЛЕННЯ ОЦІНОК У ЖУРНАЛ ---")
cabinet.set_auto_grade(journal_key, group_list[0], "A") # Алексєєнко Анна
cabinet.set_auto_grade(journal_key, group_list[1], "B") # Гайдай Анатолій

# 5. Висновок результату у JSON (імітація експорту)
print("\n--- ЕКСПОРТ ДАНИХ (фрагмент) ---")
sample_data = cabinet.journals[journal_key]["студенти"][group_list[0]]
print(f"Студент: {group_list[0]} | Дані: {sample_data}")
